enkia.tokyo-night
PKief.material-icon-theme
PKief.material-product-icons
usernamehw.errorlens
eamodio.gitlens
esbenp.prettier-vscode
editorconfig.editorconfig
christian-kohler.path-intellisense
visualstudioexptteam.vscodeintellicode
streetsidesoftware.code-spell-checker
gruntfuggly.todo-tree
wayou.vscode-todo-highlight
aaron-bond.better-comments
github.copilot
github.copilot-chat
anthropic.claude-code
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
charliermarsh.ruff
ms-python.mypy-type-checker
golang.go
rust-lang.rust-analyzer
tamasfe.even-better-toml
redhat.vscode-yaml
ms-azuretools.vscode-docker
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-containers
mikestead.dotenv
